Autodesk.Revit.DB.Electrical.ElectricalPerPhaseData.CurrentPhaseC
The effective value of current on electrical phase C.
Since:
2025

Autodesk.Revit.DB.Electrical.ElectricalPerPhaseData.CurrentPhaseB
The effective value of current on electrical phase B.
Since:
2025

Autodesk.Revit.DB.Electrical.ElectricalPerPhaseData.CurrentPhaseA
The effective value of current on electrical phase A.
Since:
2025

Autodesk.Revit.DB.Electrical.ElectricalPerPhaseData
This class represents per phase values including current and power.
Since:
2025